#ifndef PDFINFO_H
#define PDFINFO_H

#include <string>

//======================================================
// PdfInfo
//
// Структура містить усю інформацію
// про один PDF-файл.
//
// Вона використовується майже
// всіма модулями програми.
//
//======================================================

struct PdfInfo
{
    //--------------------------------------------------
    // Початкова назва PDF.
    //--------------------------------------------------
    std::string fileName;

    //--------------------------------------------------
    // Повний шлях до PDF.
    //--------------------------------------------------
    std::string fullPath;

    //--------------------------------------------------
    // ІПН, знайдений у PDF.
    //--------------------------------------------------
    std::string ipn;

    //--------------------------------------------------
    // Назва нового PDF,
    // отримана з Excel.
    //--------------------------------------------------
    std::string newFileName;

    //--------------------------------------------------
    // Кінцеве місце файлу
    // після виконання програми.
    //
    // Наприклад:
    //
    // Мальцев Віталій.pdf
    //
    // або
    //
    // Повтори/Мальцев/...pdf
    //
    // або
    //
    // Не знайдено/2026.pdf
    //--------------------------------------------------
    std::string resultPath;

    //--------------------------------------------------
    // Чи знайдений ІПН у Excel.
    //--------------------------------------------------
    bool foundInExcel = false;

    //--------------------------------------------------
    // Підсумковий статус.
    //
    // RENAMED
    // DUPLICATE
    // NOT_FOUND
    // ERROR
    //--------------------------------------------------
    std::string status;
};

#endif