#ifndef RENAMER_H
#define RENAMER_H

#include <string>

//======================================================
// Renamer.h
//
// Модуль виконує всі операції з файлами.
//
// 1. Перейменування PDF.
// 2. Переміщення дублікатів.
// 3. Переміщення файлів без ІПН.
//
//======================================================

//------------------------------------------------------
// Перейменувати PDF.
//
// oldFile    - повний шлях до початкового PDF.
// folder     - папка, у якій лежать PDF.
// newName    - нова назва без ".pdf".
//
// Приклад:
//
// oldFile
// /home/alexubuntu/Мальцев/7 (2).pdf
//
// folder
// /home/alexubuntu/Мальцев
//
// newName
// Мальцев Віталій Вікторович 2909218798
//
// Результат:
//
// /home/alexubuntu/Мальцев/
// Мальцев Віталій Вікторович 2909218798.pdf
//
// Повертає:
//
// true  - файл успішно перейменовано.
//
// false - файл уже існує
//         або виникла помилка.
//------------------------------------------------------
bool renamePdf(const std::string& oldFile,
               const std::string& folder,
               const std::string& newName);

//------------------------------------------------------
// Перемістити PDF у папку
//
// Повтори/<ПІБ>/
//
// Викликається,
// якщо файл з такою назвою
// вже існує.
//------------------------------------------------------
bool moveToDuplicates(const std::string& pdfFile,
                      const std::string& personName);

//------------------------------------------------------
// Перемістити PDF у папку
//
// Не знайдено/
//
// Викликається,
// якщо ІПН не знайдено.
//------------------------------------------------------
bool moveToNotFound(const std::string& pdfFile);

#endif